// prog2_4_2.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <iostream>

int main()
{
    double r1 = 3.14;
    double r2 = 6.28;
    double r3 = 9.42;
    double r4 = 12.56;
    const double r5 = 15.7;
    const double r6 = 18.84;
    double r7 = 201;
    const double r8 = 202;

    double *p1 = &r1;    // 普通指针
    const double *p2 = &r5, *p3;    // 指向常量的指针，可以不初始化，但不能改变所指对象的值
    p3 = &r2;       //指向常量的指针也可以指向非常量，但不能改变所指对象的值
    double *const p4 = &r3;     //常量指针，必须初始化，且指针不能再指向其他对象，不能用于指向常量
    const double *const p5 = &r6;     //指向常量的常量指针，必须初始化，且指针不能再指向其他对象
    const double *const p6 = &r4;     //指向常量的常量指针，也可以指向非常量

    std::cout << "*p1 -> r1 = " << *p1 << "\n"
        << "*p2 -> r5 = " << *p2 << "\n"
        << "*p3 -> r2 = " << *p3 << "\n"
        << "*p4 -> r3 = " << *p4 << "\n"
        << "*p5 -> r6 = " << *p5 << "\n"
        << "*p6 -> r4 = " << *p6 << std::endl;

    r1 = 100;
    r2 = 101;
    r3 = 102;
    r4 = 103;
    std::cout << "*p1 -> r1 = " << *p1 << "\n"
        << "*p2 -> r5 = " << *p2 << "\n"
        << "*p3 -> r2 = " << *p3 << "\n"
        << "*p4 -> r3 = " << *p4 << "\n"
        << "*p5 -> r6 = " << *p5 << "\n"
        << "*p6 -> r4 = " << *p6 << std::endl;

    *p1 = 200;
    p2 = &r7;     // 指向常量的指针，可以改变所指的对象，但不能改变所指对象的值
    p3 = &r8;
    *p4 = 203;    //常量指针，不能改变所指的对象，但能改变所指对象的值
    std::cout << "*p1 -> r1 = " << r1 << "\n"      //输出变成r1而不是*p1，效果是一样的
        << "*p2 -> r5 = " << *p2 << "\n"
        << "*p3 -> r2 = " << *p3 << "\n"
        << "*p4 -> r3 = " << r3 << "\n"      //输出变成r3而不是*p4，效果是一样的
        << "*p5 -> r6 = " << *p5 << "\n"
        << "*p6 -> r4 = " << *p6 << std::endl;

    return 0;

}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
